{
  "start": {
    "text": "You arrive at the dimly lit town of San Gubat. The air is heavy with fear. Who do you seek for information first?",
    "choices": [
      {
        "text": "Find the old Albularyo (Healer) at the edge of town.",
        "to": "askAlbularyo"
      },
      {
        "text": "Report to the Barangay Captain at the town hall.",
        "to": "askCaptain"
      }
    ]
  },
  "askAlbularyo": {
    "text": "'It has wings like a bat and separates at the waist,' the old healer whispers, handing you a rough pouch. 'Take this salt. The Manananggal despises it.' You've gained Asin.",
    "onArrive": { "addItem": "Asin" },
    "choices": [
      {
        "text": "Thank him and head to the old church where it was last seen.",
        "to": "oldChurch_entry"
      }
    ]
  },
  "askCaptain": {
    "text": "'My best men have vanished,' the captain says grimly, handing you a braid of garlic. 'We believe it's a Wakwak, a different kind of horror. This might keep it at bay.' You've gained Bawang.",
    "onArrive": { "addItem": "Bawang" },
    "choices": [
      {
        "text": "Nod grimly and head to the old church where it was last seen.",
        "to": "oldChurch_entry"
      }
    ]
  },
  "oldChurch_entry": {
    "text": "The ancient church is silent, its stone walls covered in moss. Dust motes dance in the single moonbeam piercing the roof. Do you investigate the crumbling bell tower or the desecrated altar?",
    "choices": [
      {
        "text": "Climb the creaking stairs to the bell tower.",
        "to": "bellTower"
      },
      {
        "text": "Inspect the altar at the far end of the church.",
        "to": "altar"
      }
    ]
  },
  "bellTower": {
    "text": "In the belfry, a creature with ragged wings and sharp talons screeches! It's a Wakwak, feasting on a goat. It turns its glowing red eyes on you!",
    "choices": [
      {
        "text": "Thrust the garlic braid at it!",
        "to": "useGarlicOnWakwak",
        "requires": "Bawang"
      },
      {
        "text": "You have no garlic! Fight it with your bolo!",
        "to": "fightWakwakNoGarlic"
      },
      {
        "text": "This isn't a Manananggal. The salt is useless here.",
        "to": "fightWakwakNoGarlic",
        "requires": "Asin"
      }
    ]
  },
  "useGarlicOnWakwak": {
    "text": "The Wakwak recoils from the pungent garlic, giving you an opening! You slash with your bolo, wounding its wing. It shrieks and flies off into the night, dropping something shiny.",
    "onArrive": { "addItem": "Agimat" },
    "choices": [
      {
        "text": "You found an Agimat! Continue to the rice fields.",
        "to": "riceFields_entry"
      }
    ]
  },
  "fightWakwakNoGarlic": {
    "text": "Without the garlic to weaken it, the Wakwak is too fast and ferocious. It claws you deeply before you can land a solid blow. You lose 30 HP and it escapes.",
    "onArrive": { "takeDamage": 30 },
    "choices": [
      {
        "text": "Wounded, you limp towards the rice fields.",
        "to": "riceFields_entry"
      }
    ]
  },
  "altar": {
    "text": "The altar is overturned. Behind it, you find a small, intricately carved amulet throbbing with a faint warmth. It feels protective. You've found an Agimat.",
    "onArrive": { "addItem": "Agimat" },
    "choices": [
      {
        "text": "With the amulet secured, you head towards the rice fields.",
        "to": "riceFields_entry"
      }
    ]
  },
  "riceFields_entry": {
    "text": "The moon hangs high over the vast, dark rice paddies. The air is still, save for the chirping of crickets. In the distance, you hear the faint sound of a baby crying.",
    "choices": [
      {
        "text": "It's a trap. A Tiyanak. Ignore it and press on.",
        "to": "baleteTree_approach"
      },
      {
        "text": "It could be a real child! Investigate the sound.",
        "to": "investigateTiyanak"
      }
    ]
  },
  "investigateTiyanak": {
    "text": "You follow the crying to a small thicket. As you part the leaves, the crying stops. A small, monstrous creature with sharp teeth leaps out, biting your leg before scurrying away! It was a Tiyanak!",
    "choices": [
      {
        "text": "You fell for the oldest trick in the book! (Lose 25 HP)",
        "to": "tiyanakDamage",
        "hideIf": "Agimat"
      },
      {
        "text": "Your Agimat glows, repelling the creature before it can bite!",
        "to": "baleteTree_approach",
        "requires": "Agimat"
      }
    ]
  },
  "tiyanakDamage": {
    "text": "The bite is painful and you feel a strange weakness spreading. You lose 25 HP. You curse your foolishness and continue towards the ominous Balete tree.",
    "onArrive": { "takeDamage": 25 },
    "choices": [
      {
        "text": "Continue, more cautious than before.",
        "to": "baleteTree_approach"
      }
    ]
  },
  "baleteTree_approach": {
    "text": "You've reached the heart of the darkness: a massive, ancient Balete tree with thick, hanging roots. You can hear a sickening squelching sound from above. The Manananggal is here. This is the final battle.",
    "choices": [
      {
        "text": "Charge the tree and attack the creature head-on!",
        "to": "finalFight_direct"
      },
      {
        "text": "Remember the lore. Search for the lower half of its body.",
        "to": "finalFight_search"
      }
    ]
  },
  "finalFight_direct": {
    "text": "You attack the flying creature directly, but it's too agile in the air. It swoops down, its claws tearing at you. Your bravery costs you dearly. You lose 50 HP.",
    "onArrive": { "takeDamage": 50 },
    "choices": [
      {
        "text": "You're heavily wounded! You must find its lower half!",
        "to": "finalFight_search"
      }
    ]
  },
  "finalFight_search": {
    "text": "You ignore the airborne horror and frantically search the base of the Balete tree. Hidden among the gnarled roots, you find it: the creature's vulnerable lower torso, standing motionless.",
    "choices": [
      {
        "text": "Pour the holy salt into the torso!",
        "to": "goodEnding",
        "requires": "Asin"
      },
      {
        "text": "You don't have salt! Hack at it with your bolo!",
        "to": "badEnding_noSalt"
      }
    ]
  },
  "goodEnding": {
    "text": "As the salt touches the flesh, the torso erupts in black smoke. High above, the winged creature gives a final, agonizing shriek and disintegrates into dust. The sun begins to rise. You have saved San Gubat.",
    "isEnding": true
  },
  "badEnding_noSalt": {
    "text": "Your bolo cuts deep, but it's not enough. The creature swoops down, enraged, and impales you with its sharp tongue. Your lack of the proper tool was your undoing. GAME OVER.",
    "isEnding": true
  },
  "gameOver_hp": {
    "text": "Your wounds are too severe. You collapse, and the darkness consumes you. Your hunt ends in failure. GAME OVER.",
    "isEnding": true
  }
}
